{
  "_comment": "Curlew Cottage Content Updates - NO SCHEMA CHANGES",
  "_documentId": "0d37a3b4-a777-4999-b1d3-916c1b74744b",
  "_type": "property",
  "_slug": "curlew-cottage",
  "_note": "Uses existing schema fields only. Property reference embedded in 'source' field using parentheses.",

  "overviewIntro": "Curlew Cottage is a cosy family holiday cottage in Bruichladdich on the Isle of Islay, Scotland, sleeping 6 guests in 3 bedrooms. Managed by Pi and Lynton, Airbnb Superhosts with a 4.97/5 rating across 380+ reviews at Portbahn House and Shorefield. This converted steading features a private access road, walled garden, and safe environment for families with children.",

  "description": "Curlew Cottage is a converted stone steading in Bruichladdich on the Isle of Islay, sleeping 6 guests in 3 bedrooms. This is the owner's personal Islay retreat—a family cottage kept for private use until now, and available for guest bookings for the first time in 2026.\n\nManaged by Pi and Lynton, Airbnb Superhosts with a 4.97/5 rating across 380+ reviews at their other Islay properties (Portbahn House and Shorefield). You can expect the same high standards of cleanliness, thoughtful equipment, and responsive hosting that have earned them consistently outstanding reviews.\n\nUnlike Portbahn House and Shorefield, Curlew is pet-free, making it ideal for families with children and guests with allergies. The cottage sits in an elevated position surrounded by farmland between Bruichladdich and Port Charlotte, overlooking Loch Indaal. With a private access road shared by only two neighbouring homes and a fully walled garden, Curlew creates a safe, secluded environment perfect for families.\n\nThe ground floor features a large dining/family room, sitting room with wood-burning stove, fully equipped kitchen with dishwasher and microwave, and laundry room with washing machine, tumble dryer, and airing pulley. The main bathroom includes both a bath and shower. Upstairs, two bedrooms share the landing, while a third bedroom is accessed via a separate stair and has its own small ensuite bathroom.\n\nThe cottage has oil-fired central heating, double glazing throughout, and a cosy wood-burning stove making this an ideal year-round retreat for families visiting the Scottish Islands. Broadband wifi is available.\n\nOutside, the walled rear garden includes an old greenhouse and garage for storage, created from former farm steading buildings. Ample parking accommodates several cars.\n\nBruichladdich Distillery is a 10-minute walk along the coastal cycle path, with swimming beaches equally accessible at Portbahn, by the war memorial.\n\nPort Charlotte is 5 minutes drive by car or 45 minutes walk along the scenic cycle path. Perhaps Islay's prettiest village, set on an old harbour, it has two pub/hotels, The Port Charlotte and The Lochindaal, both with excellent seafood and very extensive whisky selections and both family-friendly. There is also a shop with post office and petrol pump in the village.\n\nBruichladdich village shop is 10 minutes walk or 2 minutes drive in the other direction. The Mini Market serves excellent coffee and sandwiches and stocks basic supplies such as bread milk and firewood.\n\nCurlew Cottage is a great base for families seeking a quiet, safe Isle of Islay home for exploring beaches, distilleries, and coastal walks.\n\nPlease note: Curlew Cottage is not pet-friendly.",

  "reviewHighlights": [
    {
      "_key": "trust_host1",
      "quote": "A big thank you to Pi for his proactivity when our ferry was cancelled.",
      "rating": 5,
      "source": "Airbnb, October 2025 (Portbahn House)"
    },
    {
      "_key": "trust_host2",
      "quote": "The host was extremely kind and responsive. The house felt like a home.",
      "rating": 5,
      "source": "Airbnb, August 2025 (Portbahn House)"
    },
    {
      "_key": "trust_host3",
      "quote": "Pi was so friendly and helpful, the local seafood and whisky is incredible. Would highly recommend as a home base to explore the island.",
      "rating": 5,
      "source": "Airbnb, November 2025 (Shorefield)"
    },
    {
      "_key": "trust_host4",
      "quote": "Pi and the team were incredible hosts. Everything was clean, sufficient supplies, friendly communication.",
      "rating": 5,
      "source": "Airbnb, June 2025 (Portbahn House)"
    }
  ],

  "_implementation_notes": {
    "schema_changes": "NONE - uses existing fields only",
    "property_reference_method": "Embedded in 'source' field using parentheses pattern",
    "example": "source: 'Airbnb, October 2025 (Portbahn House)'",
    "parsing_logic": "Frontend can extract property name from parentheses if needed, or display as-is",
    "cleanup": "When Curlew gets real reviews, simply replace reviewHighlights array with actual guest reviews"
  }
}
